# GetClTextureT

## Description
Function GetClTextureT returns the roof top texture of the specified class.

```pascal
FUNCTION GetClTextureT(className : STRING) : LONGINT;
```

```python

def vs.GetClTextureT(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|

## Remarks
Returns the roof top texture of the class named className.

## Version
Availability: from VectorWorks8.0
## Category
* Textures